//=============================================
//
// 固い板「board_hard.cpp」
// Author松田永久
//
//=============================================
#include "board_hard.h"

namespace
{
	const char* FILE_PATH = "data\\MODEL\\board\\cactus.x";
}
//=============================================
// コンストラクタ
//=============================================
My::CBoardHard::CBoardHard(int nPriority):CBoard(nPriority)
{
}

//=============================================
// デストラクタ
//=============================================
My::CBoardHard::~CBoardHard()
{
}

//=============================================
// 描画
//=============================================
void My::CBoardHard::Draw()
{
	//親クラスの描画
	CBoard::Draw(COLOR_WHITE);
}
