//=============================================
//
//板「board.cpp」
// Author松田永久
//
//=============================================
#include "board.h"

//=============================================
//コンストラクタ
//=============================================
My::CBoard::CBoard(int nPriority):CModel_Parts()
{
}

//=============================================
//デストラクタ
//=============================================
My::CBoard::~CBoard()
{
}

//=============================================
//描画
//=============================================
void My::CBoard::Draw()
{
	//親クラスの描画処理
	CModel_Parts::Draw();
}

//=============================================
//描画
//=============================================
void My::CBoard::Draw(D3DXCOLOR col)
{
	//親クラスの描画処理
	CModel_Parts::Draw(col);
}

//=============================================
//生成
//=============================================
My::CBoard* My::CBoard::Create(D3DXVECTOR3 pos, CBoard* board)
{
	CBoard* pBoard = board;

	if (pBoard == nullptr) { return nullptr; }

	pBoard->SetPos(pos);

	return pBoard;
}
