//=============================================
//
//アタックポイント中[attack_point_down.cpp]
//Author Matsuda Towa
//
//=============================================
#include "hit_UI_stun.h"

namespace
{
	std::string TEX_NAME = "data\\TEXTURE\\stun.png";	//ファイルパス
}

//=============================================
//コンストラクタ
//=============================================
My::CHit_UI_Stun::CHit_UI_Stun(int nPriority) :CHit_UI(nPriority)
{
}

//=============================================
//デストラクタ
//=============================================
My::CHit_UI_Stun::~CHit_UI_Stun()
{
}

//=============================================
//初期化
//=============================================
HRESULT My::CHit_UI_Stun::Init()
{
	//親クラスの初期化
	CHit_UI::Init();

	CTexture* pTexture = GET_TEXTURE;

	BindTexture(pTexture->GetAddress(pTexture->Regist(&TEX_NAME)));

	return S_OK;
}

//=============================================
//終了
//=============================================
void My::CHit_UI_Stun::Uninit()
{
	//親クラスの終了
	CHit_UI::Uninit();
}

//=============================================
//更新
//=============================================
void My::CHit_UI_Stun::Update()
{
	//親クラスの更新
	CHit_UI::Update();
}

//=============================================
//描画
//=============================================
void My::CHit_UI_Stun::Draw()
{
	//親クラスの描画
	CHit_UI::Draw();
}