//=============================================
//
//リロード状況表示「reload_UI.h」
// Author松田永久
//
//=============================================
#include "reload_UI.h"

//リロードテキストの位置
const D3DXVECTOR3 CReload_UI::TXT_POS = { 650.0f,430.0f,0.0f };
//リロードテキストのサイズ
const D3DXVECTOR2 CReload_UI::TXT_SIZE = { 100.0f, 30.0f };

//=============================================
// コンストラクタ
//=============================================
CReload_UI::CReload_UI():
m_pTxt(nullptr)				//テキストポインタ
{
}

//=============================================
// デストラクタ
//=============================================
CReload_UI::~CReload_UI()
{
}

//=============================================
// 初期化
//=============================================
HRESULT CReload_UI::Init()
{
	if (m_pTxt == nullptr)
	{
		m_pTxt = CReloatTxt::Create(TXT_POS, TXT_SIZE, COLOR_WHITE);
	}
	return S_OK;
}

//=============================================
// 終了
//=============================================
void CReload_UI::Uninit()
{
	if (m_pTxt != nullptr)
	{
		m_pTxt->Uninit();
		m_pTxt = nullptr;
	}
}

//=============================================
// 更新
//=============================================
void CReload_UI::Update()
{
}